class Студент:
    def __init__(self, імʼя, вік, спеціальність):
        self.імʼя = імʼя
        self.вік = вік
        self.спеціальність = спеціальність
        self.оцінки = []

студент1 = Студент("Олександр", 20, "Комп'ютерні науки")
студент2 = Студент("Марія", 21, "Право")

print(f"{студент1.імʼя} має вік {студент1.вік} років.")

class Книга:
    def __init__(self, назва, автор, рік):
        self.назва = назва
        self.автор = автор
        self.рік = рік
    
    def __str__(self):
        return f"'{self.назва}' (Автор: {self.автор}, Рік: {self.рік})"

книга1 = Книга("1984", "Джордж Орвелл", 1949)

print(книга1)

представлення = str(книга1)
print(представлення)